tap "homebrew/homebrew-cask"
tap "homebrew/cask-fonts"
tap "klaaspieter/formula"
tap "thoughtbot/formulae"
tap "gfontenot/formulae"
tap "robotsandpencils/made"

# Unix
brew "bat"
brew "direnv"
brew "git"
brew "gnupg"
brew "neovim"
brew "openssl"
brew "pass"
brew "rcm"
brew "shellcheck"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "xcrecord"
brew "zoxide"
brew "zsh"

# Image manipulation
brew "imagemagick"

# Programming language prerequisites and package managers
brew "autoconf"
brew "coreutils"
brew "libyaml" # should come after openssl
brew "docker"

# Mac
brew "trash"

# Databases
brew "postgres", restart_service: :changed
brew "redis", restart_service: :changed

# Xcode
brew "carthage"
brew "chxcode"
brew "xcode-cli"
brew "xcodes"

# Fonts
cask "font-hack"
cask "font-hack-nerd-font"

# Apps
cask "alfred"
cask "bartender"
cask "caffeine"
cask "expressvpn"
cask "firefox"
cask "istat-menus"
cask "sketch"
cask "slack"
cask "steam"
cask "transmission"
cask "whatsapp"
cask "kitty"
cask "macvim"
cask "garmin-express"
cask "vlc"
cask "the-unarchiver"
cask "docker"
cask "graphql-playground"

# Mac App Store
mas "Letters", id: 1196993429
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things", id: 904280696
mas "Magnet", id: 441258766
mas "Tweetbot", id: 1384080005
