tap "caskroom/cask"
tap "klaaspieter/formula"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"

# Unix
brew "autojump"
brew "git"
brew "gnupg"
brew "neovim"
brew "openssl"
brew "pass"
brew "rcm"
brew "shellcheck"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "xcrecord"
brew "zsh"

# GitHub
brew "hub"

# Image manipulation
brew "imagemagick"

# Programming language prerequisites and package managers
brew "autoconf"
brew "coreutils"
brew "universal-ctags", args: ["HEAD"]
brew "libyaml" # should come after openssl

# Mac
brew "trash"

# Databases
brew "postgres", restart_service: :changed
brew "redis", restart_service: :changed

# Xcode
tap "gfontenot/formulae"
brew "carthage"
brew "chxcode"
brew "swiftlint"
brew "xcode-cli"

# Fonts
tap "caskroom/fonts"
cask "font-hack"

# Apps
cask "alfred"
cask "arq"
cask "bartender"
cask "caffeine"
cask "dash"
cask "delta"
cask "divvy"
cask "dropbox"
cask "expressvpn"
cask "firefox"
cask "istat-menus"
cask "iterm2"
cask "sketch"
cask "slack"
cask "spotify"
cask "steam"
cask "transmission"
cask "whatsapp"
cask "wkhtmltopdf"
cask "zoomus"

# Mac App Store
mas "Letters", id: 1196993429
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things", id: 904280696
mas "Markoff", id: 1084713122
